{
    "paths":[
        {
            "index": 0,
            "title": "Opener",
            "textBox": [
                "Kanata was once a commander in his home's military and fought in a war many years ago.", 
                "During this war, he fought a man named Rhyes, a commander for the other side. Kanata won against him in a duel, leaving him the only one standing.",
                "When he returned, he started seeing Rhyes around him. He were being haunted by him, and Rhyes is not a quiet man.",
                "In the years since, he has grown acustomed to Rhyes'...company and lack of 'off switch' but Kanata has never responded to him."
            ],
            "options": [
                {
                    "text": "Continue",
                    "index": 0,
                    "next": 1,
                    "timer": 0
                }
            ]
        },
        {
            "index": 1,
            "title": "Begin",
            "textBox": [
                "Kanata moved around his small village home, making breakfast, cleaning up a bit, the basic morning tasks",
                "As he did this, he could see Rhyes move in and out of his vision as he looked around Kanata's home",
                "He seems to always be interested in the devices and knick knacks Kanata had around his kitchen and often asks queations about them",
                "\"Hey!\" He calls out to get Kanata's attention, \"What's this?\"",
                "Kanata looked over and saw that Rhyes' was pointing a small scuplture of a cat on a shelf",
                "Does he answer Rhyes?"
            ],
            "options": [
                {
                    "text": "Continue",
                    "index": 0,
                    "timer": 0,
                    "leave": 5
                },
                {
                    "text": "Answer",
                    "index": 1,
                    "next": 2,
                    "timer": 5
                },
                {
                    "text": "Ignore",
                    "index": 2,
                    "next": 3,
                    "timer": 5
                }
            ]
        },
        {
            "index": 2,
            "title": "Answer",
            "textBox": [
                "\"It's a sculpture one of my soldiers made during our down time.\"",
                "The ghost jumped at the sound of Kanata's voice, having not expected an answer.",
                "He smiled and continued his idle chatter and asking more quetions, not caring if he got an answer or not.",
                "During this, Kanata cought a mention of wanting to go to the forest nearby. Something about animals and plants",
                "Do you go to forest as the ghost wants?"
            ],
            "options": [
                {
                    "text": "Continue",
                    "timer": 0
                }
            ]
        },
        {
            "index": 3,
            "title": "Ignore",
            "textBox": [
                "The ghost isn't surprised by your silence and continues looking around the kitchen.",
                "He does ask about other things on the shelves but you don't answer him.",
                "Do you wish to go to the woods or to the market?"
            ],
            "options": [
                {
                    "text": "Continue",
                    "timer": 0
                }
            ]
        }
    ]
}